# 2. Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.
#    Входные и выходные данные хранятся в отдельных текстовых файлах.

# не понял вообще ничего, + нехватка времени, меня очень фрустрировала эта задачка, даже не знаю как быть
# видимо фалы это не мой уровень, как то странно, обещали что python будет проще, хотя С# мне был намного интуитивнее понятен,
# а здесь непонятные встроенные функции и т.д
# такое ощущение что я отстал от своих одногрупников, либо я единственный с 0 базовым знанием сюда пришел